Revit 2027 API
BRepBuilderGeometryId Constructor
 Copy constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BRepBuilderGeometryId(
	BRepBuilderGeometryId other
)
Public Sub New (
	other As BRepBuilderGeometryId
)
public:
BRepBuilderGeometryId(
	BRepBuilderGeometryId^ other
)
new :
        other : BRepBuilderGeometryId -> BRepBuilderGeometryId
Parameters
other BRepBuilderGeometryId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace